---
layout: post
title: '아주아주 중요한 전환 캠페인'
categories: 디지털마케팅
description : '전환캠페인과 전환 지연시간 보고서에 대해 알아보기'
tags: [ 광고, 전환 ]
permalink: /conversion-and-conversion-campaign
featured_image_thumbnail: assets/images/posts/221020/post_thumb-001.jpg
featured_image: /assets/images/posts/20221020/post_thumb-001.jpg
featured: true
hidden: true
---

# 전환이 제일 중요하다.

전환을 추적하면 우리 웹사이트(혹은 앱)에서 발생한 중요한 것에 대해 알 수 있다. 대표적으로 구매 라는 이벤트는 전환을 말할 때 빼먹을 수 없는 아주 중요한 전환항목이다. 근데 구매를 빼고 나면 그때부턴 전환 설정에 대해 살짝 자신감이 빠지기 시작한다. 구매가 전환이라면 장바구니 담는 것은 전환인가? 장바구니까지는 아닌 듯하고 결제시작을 누른다면 그건 전환이 아닐까? 그럼 쿠폰을 받은 경우에는 전환으로 수집해도 되는걸까? 이런이런...우리는  전환을 어떻게 이해하고 있는 걸까?

거의 대부분의 전환은 비즈니스에서 가치를 만들어내는 액션들과 관련이 있고 그것이 꼭 수익을 발생시켜야 하는 것은 아니다. 사람들이 방문해서 꼭 해줬으면 하는 액션을 최종 전환 목표라고 한다면 그 중간중간 닿을 수 있는 액션들도 체크포인트처럼 여기고 전환으로 설정해도 되는 것이다. 전환으로 설정한 이벤트의 수가 많다고 꼭 나쁘게 생각할 필요까지는 없지만 **왜 전환으로 설정했는지 알고 설정했는지**가 정말 중요하다.

## 전환을 잘 설정해야 하는 이유

대부분의 비즈니스는 현상 개선이 필요하다. 그렇기에 기도메타로 마냥 응수할 수는 없어, 꼼꼼하게 사용자의 행동 데이터를 수집하고 수시로 변화하는 데이터를 체크해야 하는 것이다. 특히 관심이 필요한 녀석들을 위해 GA4를 비롯한 사용자 행동 분석 툴에는 전환율을 계산하는 기능들을 보고서에 포함시켜 놓았다. GA4 입장에서 수십~수백만에 달하는 가지각색의 웹사이트가 무슨 행동을 전환으로 설정할지 알 수 없는 노릇이다. 그래서 그들은 분석툴을 통해 이렇게 말하는 듯 하다.

> "너희가 각자 알아서 필요한 것들을 전환이라고 표시해주면 우리가 그거 기준으로 결과값을 보여줄게. 단, 무슨 행동을 전환으로 설정할지 잘 생각해! "

불필요한 이벤트까지 과하게 전환으로 설정한 경우 이런 문제가 발생할 수 있다. "와~! 우리 서비스 전환율 짱이야!", "저 이번에 새로 진행한 전환 캠페인 전환당 비용이 100원도 안나왔어요! 히히"  전환율과 전환당 비용 같은 지표는 마케터들에게 늘 부담스런 아이들이다. 하지만 page_view 같은 이벤트를 전환으로 수집한다면 전환율이 너무 높아 행복한 고민을 할지도 모른다. 그럼 결국 <u>우리가 속한 비즈니스에서 어떤 행동을 전환으로 삼을 것인가를 논하는게 정말 중요한 것</u>이다.



## 전환 캠페인 하는 사람은 보세요

얼마 전에 모바일게임 광고를 보고 재밌을 것 같아 다운로드 받아봤다. 처음엔 낯설었는데 하다보니 재미를 느껴서 한동안 꽤 즐겼다. 처음엔 낯선 게임이라 바로 현질은 하지 않았고 4일 정도 지났을 때 쯤 초보자 패키지가 할인을 많이 한다고 해서 9천원 쯤 내고 구매했다. 그렇다. 그렇게 나는 캠페인의 전환 수에 포함되었다. 그런데 만약 이게 트래픽캠페인이 아닌 전환 캠페인이었다면 내가 다운로드 받은 시점인 첫 날에 내 전환 수가 찍히지 않았을텐데 전환 캠페인은 어떻게 동작하는걸까?

![전환 지연 프로세스](https://hongxha.com/assets/images/posts/20221020/1.jpg)*전환 지연 프로세스를 이해해보자*

이건 이 글보다 먼저 작성된 전환 추적기간에 대한 글과 관련이 깊은데, 광고가 노출되거나 클릭이 발생 후 특정 기간 안에 전환이 발생하면 그것도 해당 광고가 기여한 전환으로 인정한다. 이것을 전환 추적기간 설정이라고 하는데, 보통 클릭 후 7일 조회후 1일 같이 정해져 있고 구글 광고나 일부 광고는 전환 추적기간을 원하는 대로 설정할 수 있다. 즉, 내가 광고를 본 당시에는 반응이 없다가 하루가 지난 뒤 앱을 설치하면 1일 지연된 first_open 전환이 발생한 것이고, 그 뒤 3일이 더 지나고 나서 내가 구매한 초보자 패키지의 구매 전환이 발생한 것이다.

이때, 게임에 설정된 전환에 first_open과 인앱 결제가 모두 포함되었다면 해당 캠페인은 나 라는 사용자 1명에게서 2개의 전환을 만들어냈다는 리포트를 받게될 것이다. 단, 4일이 지난 이후에 말이다. 그래서 친절한 구글에는 전환 캠페인에서 발생하는 전환 지연에 대해 간략한 보고서를 제공해주는데 이것을 **전환 지연시간 보고서**라고 한다. 전환 지연 보고서는 제공하는 정보가 상당히 유익하다. 하지만 앞뒤 정황을 모르고 전환캠페인이 돌려나보자 하는 마음이라면 구글이 대체 왜 나에게 이런 문제를 내는 것인가 하고 알쏭달쏭할 수 밖에 없다.

## 전환 캠페인의 전환 지연 이해하기

구글애즈에서 전환 캠페인을 하면 대충 아래 우측과 같은 전환 지연시간 보고서를 확인할 수 있다.

![전환 캠페인](https://hongxha.com/assets/images/posts/20221020/2.jpg)*전환 캠페인의 보고서 이해하기*

구글의 세일즈팀에게 전화상담을 받아본 분이라면 대충 이런 질문 한번쯤 해봤을 것이다. "광고 최적화는 몇 일 걸리나요?" 그리고 원하는 답을 명쾌하게 들을 수 없었을 것이다. 그런 질문에 답을 하려면 보다 많은 정보가 필요하다. 그 중에서도 중요한 정보가 전환이다. 구글에선 보통 "하루 기준 발생하는 전환의 수가 20개 이상이라면 최적화는 1주일 안에 끝날 것이다"는 피드백을 주신다. 개인적으로 이 답변이 가장 맘에 든다. 그나마 균형있고 마케터가 개입 가능한 수준이라고 생각하기 때문이다. 그러나 여기서 문제는 전환을 너무 가볍거나 많이 설정하면 이상한 타겟을 향해 학습될 것이다. 혹은 핵심 전환은 발생하지 않고 있는데 엉뚱한 페이지 조회만 전환으로 잡히면서 전환당 비용은 낮고 체감되는 비즈니스 성과는 아주 바닥인 경우가 분명히 있을 것이다.

아무튼 전환 지연시간 보고서는 그동안 해당 캠페인의 성과를 바탕으로 전환 성과를 예측하여 제공한다. 특히 위 이미지에서 두번째 줄인 "대부분의 인앱 액션이 보고되려면 노출 발생 후 최대 5일이 걸립니다." 라는 부분에 주목해야 하는데, 이는 우리가 설정한 인앱 액션이 사용자들 평균적으로 5일 정도 뒤에나 대부분 발생한다는 정보인 것이다. 이 중에는 전환도 포함되어 있을 수 있고 아닐 수도 있다. 아마 비즈니스 핵심 전환만을 놓고 저 지연시간 보고서를 제공한다면 예시처럼 **최대 5일이 아니라 최대 993일** 같이 힘빠지는 숫자를 받을 수도 있어서 아마 충격방지 요법으로 전환이 아닌 인앱액션 기준으로 제시했을 것이라고 생각해본다.

이렇게 하루하루 시간이 지남에 따라 전환 추적기간동안 새로운 전환들이 지연하여 발생할 것이고 그 캠페인은 지난 시간의 내 성과를 인정해달라고 떼를 쓸 것이다. 예시처럼 11월 1일에 CPI와 CPA는 각각 2,000원과 10,0000원 정도였지만 3일이 지난 뒤 추가로 여러 인스톨과 전환액션이 발생하여 11월 1일의 그 캠페인의 CPI와 CPA는 소폭 감소하여 보일 것이다.

이건 누군가에게는 상당히 충격적인 내용일 수도 있을 것이라 생각한다. 특히 디지털마케팅을 외주로 맡기고 있거나 잘 이해하지 못한 상태에서 광고를 돌린다면 매일 리포팅을 받는 것이 정확한 정보는 아닐 것이라는 생각이 들 수도 있다. 그리고 전환을 어떻게 설정했는지, 무슨 액션을 전환으로 정의했는지에 따라 캠페인 전환 성과는 왜곡될 여지가 상당하다.

### 오늘의 요약

전환의 중요성과 전환캠페인

1. 전환을 설정할 때는 왜 설정했는지에 대한 기준을 꼭 세워보자.
2. 아무거나 전환으로 설정하고 데이터를 오해하는 것을 경계해야 한다.
3. 전환 캠페인을 할 때는 전환 데이터가 지연 수집되는 것을 이해하면 좋다.
4. 특히 전환 캠페인은 매일매일 보고서에 집착할 필요는 없다.
5. 어쨌든 전환 설정을 다 잘했다면 이제부턴 기도메타 "전환 잘 나와라🙏"
